IDEA Open Model
ReinfType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of reinforcement
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum ReinfType
Public Enumeration ReinfType
Members
Member name | Value | Description
Bars | 0 |  Bars
DecoiledRods | 1 |  Decoiled rods
WireFabrics | 2 |  Wire fabrics
LatticeGirders | 3 |  Lattice girders
See Also
Reference
IdeaRS.OpenModel.Material Namespace